UNIFICATION_MAPPING: dict[str, str] = {
    "Азиатский барсук": "Барсук",
    "Барсук": "Барсук",
    "Гималайский медведь": "Гималайский медведь",
    "Черный медведь": "Гималайский медведь",
    "Медведь": "Бурый медведь",
    "Бурый медведь": "Бурый медведь",
    "Снежный барс": "Ирбис",
    "Ирбис": "Ирбис",
    "Колонок": "Другие животные",
    "Собака": "Другие животные",
}

CLASSES_TO_USE: set[str] = {
    "Амурский лесной кот",
    "Аргали",
    "Барсук",
    "Бурый медведь",
    "Волк",
    "Енотовидная собака",
    "Заяц",
    "Изюбрь",
    "Ирбис",
    "Кабан",
    "Кабарга",
    "Козерог",
    "Лиса",
    "Манул",
    "Марал",
    "Пятнистый олень",
    "Росомаха",
    "Рысь",
    "Сибирская косуля",
    "Соболь",
    "Сурок",
    "Тигр",
    "Хорза",
    "Другие животные",
}
# drop: выдра, косуля

LABEL_TO_INDEX: dict[str, int] = {cls_name: index for index, cls_name in enumerate(sorted(list(CLASSES_TO_USE)))}
INDEX_TO_LABEL: dict[int, str] = {index: cls_name for cls_name, index in LABEL_TO_INDEX.items()}
